## Pandas

In [1]:
import pandas as pd

In [2]:
raw=pd.read_excel("./data/name_sample.xlsx")
raw.head()

  StateCode Sex  YearOfBirth      Name  Number
0        AK   F         1910      Mary      14
1        AK   F         1910     Annie      12
2        AK   F         1910      Anna      10
3        AK   F         1910  Margaret       8
4        AK   F         1910     Helen       7

In [3]:
raw.tail() # DataFrame 형태

   StateCode Sex  YearOfBirth     Name  Number
46        AK   F         1914    Julia       5
47        AK   F         1914  Lillian       5
48        AK   F         1914  Mildred       5
49        AK   F         1914  Pauline       5
50        AK   F         1915     Mary      23

In [4]:
raw.head(3) # shift+tab해서 속성 뭐 쓸 수 있는지 확인

  StateCode Sex  YearOfBirth   Name  Number
0        AK   F         1910   Mary      14
1        AK   F         1910  Annie      12
2        AK   F         1910   Anna      10

### info
- index : 51개
- columns : 총 몇개
- null 이 아닌 것 갯수
- object : 명목형(문자)
- int : 숫자형
- float : 실수형
- category : 카테고리형(도메인 정해져있음)

In [5]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StateCode    51 non-null     object
 1   Sex          51 non-null     object
 2   YearOfBirth  51 non-null     int64
 3   Name         51 non-null     object
 4   Number       51 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

### 데이터 선택하기

In [6]:
# 칼럼 선택
raw["Name"].head() # Series, list 형태

0        Mary
1       Annie
2        Anna
3    Margaret
4       Helen
Name: Name, dtype: object

In [7]:
for name in raw["Name"].head():
    print(name)

Mary
Annie
Anna
Margaret
Helen

In [8]:
raw["Name"].unique()

array(['Mary', 'Annie', 'Anna', 'Margaret', 'Helen', 'Elsie', 'Lucy',
       'Dorothy', 'Ruth', 'Elizabeth', 'Agnes', 'Louise', 'Jean', 'Alice',
       'Esther', 'Ethel', 'Marie', 'Clara', 'Martha', 'Frances', 'Julia',
       'Lillian', 'Mildred', 'Pauline'], dtype=object)

In [9]:
raw["Name"].value_counts()

Mary         6
Margaret     5
Helen        5
Annie        4
Alice        3
Elizabeth    3
Dorothy      2
Ruth         2
Agnes        2
Louise       2
Elsie        2
Anna         2
Esther       2
Mildred      1
Martha       1
Lillian      1
Julia        1
Frances      1
Jean         1
Clara        1
Marie        1
Ethel        1
Lucy         1
Pauline      1
Name: Name, dtype: int64

In [10]:
raw["YearOfBirth"].head() + raw["Number"].head()

0    1924
1    1922
2    1920
3    1918
4    1917
dtype: int64

In [11]:
# 행 선택 : 특정 조건을 만족하는 행!

# YearOfBirth 칼럼` 값이 1912보다 적는 행
cond=raw["YearOfBirth"] < 1912
raw[cond] # True인 것만 들어옴

   StateCode Sex  YearOfBirth       Name  Number
0         AK   F         1910       Mary      14
1         AK   F         1910      Annie      12
2         AK   F         1910       Anna      10
3         AK   F         1910   Margaret       8
4         AK   F         1910      Helen       7
5         AK   F         1910      Elsie       6
6         AK   F         1910       Lucy       6
7         AK   F         1910    Dorothy       5
8         AK   F         1911       Mary      12
9         AK   F         1911   Margaret       7
10        AK   F         1911       Ruth       7
11        AK   F         1911      Annie       6
12        AK   F         1911  Elizabeth       6
13        AK   F         1911      Helen       6

In [12]:
# Name이 Mary
raw[raw["Name"] == "Mary"]

   StateCode Sex  YearOfBirth  Name  Number
0         AK   F         1910  Mary      14
8         AK   F         1911  Mary      12
14        AK   F         1912  Mary       9
27        AK   F         1913  Mary      21
34        AK   F         1914  Mary      22
50        AK   F         1915  Mary      23

In [13]:
# 셀을 선택
raw.loc[24, "Number"]

5

In [14]:
# 인덱스, 컬럼명을 선택하고 싶다
raw.index # 변수
raw.columns # 변수

Index(['StateCode', 'Sex', 'YearOfBirth', 'Name', 'Number'], dtype='object')

In [15]:
for i in raw.index:
    name=raw.loc[i, "Name"]
    number=raw.loc[i, "Number"]
    print(name, number)

Mary 14
Annie 12
Anna 10
Margaret 8
Helen 7
Elsie 6
Lucy 6
Dorothy 5
Mary 12
Margaret 7
Ruth 7
Annie 6
Elizabeth 6
Helen 6
Mary 9
Elsie 8
Agnes 7
Anna 7
Helen 7
Louise 7
Jean 6
Ruth 6
Alice 5
Esther 5
Ethel 5
Margaret 5
Marie 5
Mary 21
Elizabeth 9
Margaret 8
Helen 7
Alice 5
Annie 5
Louise 5
Mary 22
Margaret 10
Alice 8
Annie 8
Elizabeth 7
Helen 7
Clara 6
Dorothy 6
Martha 6
Agnes 5
Esther 5
Frances 5
Julia 5
Lillian 5
Mildred 5
Pauline 5
Mary 23

### 피벗테이블 집계하기

In [16]:
df=raw.pivot_table(index=["Name", "YearOfBirth"], values="Number",
                aggfunc='sum')
df=raw.pivot_table(index="Name", values="Number",
                columns="YearOfBirth", aggfunc='sum')
df=raw.pivot_table(index="Name", values="Number",
                aggfunc='sum')

In [17]:
raw[["Name", "Number"]].head()

       Name  Number
0      Mary      14
1     Annie      12
2      Anna      10
3  Margaret       8
4     Helen       7

In [18]:
df.sort_values(by="Number", ascending=False).head() # 내림차순

           Number
Name
Mary          101
Margaret       38
Helen          34
Annie          31
Elizabeth      22